oxidecomputer/DAPLink/source/hic_hal/nxp/lpc55xx/DAP_config.h
    // Configure GPIO outputs.
    GPIO->CLR[PIN_PIO_PORT] = PIN_TMS_SWDIO_TXEN_MASK   // Disable TMS/SWDIO drive.
                                | PIN_RESET_TXEN_MASK;  // Disable RESET drive.
    GPIO->SET[PIN_PIO_PORT] = PIN_DETECT_MASK; // Don't assert detect at start
    GPIO->SET[PIN_VREF_CTRL_PORT] = PIN_VREF_CTRL_MASK; // Disable VREF.

    // Set GPIO directions.
    GPIO->DIRSET[PIN_PIO_PORT] = PIN_TMS_SWDIO_TXEN_MASK
                                    | PIN_RESET_TXEN_MASK
                                    | PIN_DETECT_MASK;
    GPIO->DIRSET[PIN_VREF_CTRL_PORT] = PIN_VREF_CTRL_MASK;
    GPIO->DIRCLR[PIN_PIO_PORT] = PIN_TCK_SWCLK_MASK
                                    | PIN_TMS_SWDIO_MASK
                                    | PIN_TDO_SWO_MASK
                                    | PIN_TDI_MASK
                                    | PIN_RESET_MASK;
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
__STATIC_INLINE uint32_t RESET_TARGET(void)
{
    return (0);              // change to '1' when a device reset sequence is implemented
}

///@}


#endif /* __DAP_CONFIG_H__ */
